/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   rev_print.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fgracefo <fgracefo@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/21 20:19:52 by fgracefo          #+#    #+#             */
/*   Updated: 2020/01/21 20:37:10 by fgracefo         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

void	ft_putchar(char c)
{
	write(1, &c, 1);
}

int		main(int argc, char **argv)
{
	int		i;

	i = 0;
	if (argc == 2)
	{
		while (argv[1][i])
			i++;
		while (--i >= 0)    // i-- - означает что он сначала сравнит их а потом сделает -1
			ft_putchar(argv[1][i]); //грубо говоря i-- - это i--; while (..) {i--; .. .. } 
									//--i - означает что он сначала - сделает а потом сделает -1. Грубо говоря --i
									// это то же самое что  while (..) { .. .. i--}
	}
	write(1, "\n", 1);
	return (0);
}